# Split

In [1]:
import pandas as pd

a = "중령/김나연/소보로빵"
b=a.split('/')
pblist = []
pblist.append(b)

In [2]:
PB=pd.DataFrame(data=pblist, columns=['계급','이름','빵'])
PB

   계급   이름     빵
0  중령  김나연  소보로빵

# 파일 부른 후 엑셀 만들기

In [3]:
f = open("01-pandas_example.txt", 'r',encoding='utf-8')

pb_newlist = []
lines = f.readlines()
for line in lines:
    b=line.rstrip().split('/') #개행문자 제거
    pb_newlist.append(b)

f.close()
PB_new = pd.DataFrame(data=pb_newlist, columns=['계급','이름','빵'])
PB_new

   계급   이름      빵
0  중령  김나연   소보로빵
1  중령  김다현  초코소라빵
2  소령  김사나   사라다빵
3  중위  유정연  초코케이크

# 카톡메시지로 받은 것을 가공하기

https://hashcode.co.kr/questions/9688/%EC%A0%95%EA%B7%9C%ED%91%9C%ED%98%84%EC%8B%9D-%ED%8A%B9%EC%A0%95%EB%AC%B8%EC%9E%90%EC%97%B4-%EC%A0%9C%EA%B1%B0%ED%95%98%EA%B8%B0

In [4]:
import re

f = open("01-pandas_example2.txt", 'r', encoding='utf-8')

travel_newlist = []
lines = f.readlines()

for line in lines:
    b=line.rstrip()
    parse = re.sub('^\[\w+\]\s+\[\w+\s+\d+[:]\d+\]\s','',b)
    parse_split = parse.split('/')
    travel_newlist.append(parse_split)
    
f.close()
travel_new = pd.DataFrame(data=travel_newlist, columns=['기수','이름','행선지'])
travel_new

    기수   이름 행선지
0  71기  김쯔위  서울
1  71기  이미나  진주
2  71기  손채영  거제
3  72기  박모모  거제

In [5]:
#서울이 행선지인 사람만 고르기

seoul_cadet=travel_new['행선지'] =='서울'
sub1=travel_new[seoul_cadet]
print(sub1)

    기수   이름 행선지
0  71기  김쯔위  서울

In [6]:
geoje_cadet=travel_new['행선지'] =='거제'
sub2=travel_new[geoje_cadet]
print(sub2)

    기수   이름 행선지
2  71기  손채영  거제
3  72기  박모모  거제